Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаДоговора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаказПоставщику/Ext/ObjectModule.bsl
// Процедура ПередЗаписью выполняется перед записью документа.
// Она нужна, чтобы перед сохранением документа пересчитать суммы
// и автоматически установить статус заказа поставщику.
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	// Создаем переменную для хранения общей суммы документа.
	Итог = 0;

	// Перебираем все строки табличной части "Материалы".
	Для Каждого Стр Из Материалы Цикл
		
		// Проверяем, заполнен ли материал в текущей строке.
		// Если материал не выбран, такую строку не учитываем в сумме документа.
		Если Не ЗначениеЗаполнено(Стр.Материал) Тогда
			
			// Для пустой строки устанавливаем стоимость 0,
			// чтобы она не влияла на итоговую сумму.
			Стр.Стоимость = 0;
			
			// Переходим к следующей строке табличной части.
			Продолжить;
			
		КонецЕсли;
		
		// Рассчитываем стоимость строки:
		// количество материала умножается на цену договора.
		Стр.Стоимость = Стр.Количество * Стр.ЦенаДоговора;
		
		// Добавляем стоимость текущей строки к общей сумме документа.
		Итог = Итог + Стр.Стоимость;

	КонецЦикла;

	// Записываем рассчитанную сумму в реквизит документа "ОбщаяСумма".
	ОбщаяСумма = Итог;

	// Если статус заказа еще не заполнен,
	// автоматически устанавливаем начальный статус "Новый".
	Если Не ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусЗаказаПоставщику.Новый;
	КонецЕсли;

	// Проверяем, выполняется ли именно проведение документа.
	// При обычной записи статус менять на "ВРаботе" не нужно.
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		// Если заказ был новым, то при проведении переводим его в работу.
		Если Статус = Перечисления.СтатусЗаказаПоставщику.Новый Тогда
			Статус = Перечисления.СтатусЗаказаПоставщику.ВРаботе;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
